{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of59.bin", "group1-shard2of59.bin", "group1-shard3of59.bin", "group1-shard4of59.bin", "group1-shard5of59.bin", "group1-shard6of59.bin", "group1-shard7of59.bin", "group1-shard8of59.bin", "group1-shard9of59.bin", "group1-shard10of59.bin", "group1-shard11of59.bin", "group1-shard12of59.bin", "group1-shard13of59.bin", "group1-shard14of59.bin", "group1-shard15of59.bin", "group1-shard16of59.bin", "group1-shard17of59.bin", "group1-shard18of59.bin", "group1-shard19of59.bin", "group1-shard20of59.bin", "group1-shard21of59.bin", "group1-shard22of59.bin", "group1-shard23of59.bin", "group1-shard24of59.bin", "group1-shard25of59.bin", "group1-shard26of59.bin", "group1-shard27of59.bin", "group1-shard28of59.bin", "group1-shard29of59.bin", "group1-shard30of59.bin", "group1-shard31of59.bin", "group1-shard32of59.bin", "group1-shard33of59.bin", "group1-shard34of59.bin", "group1-shard35of59.bin", "group1-shard36of59.bin", "group1-shard37of59.bin", "group1-shard38of59.bin", "group1-shard39of59.bin", "group1-shard40of59.bin", "group1-shard41of59.bin", "group1-shard42of59.bin", "group1-shard43of59.bin", "group1-shard44of59.bin", "group1-shard45of59.bin", "group1-shard46of59.bin", "group1-shard47of59.bin", "group1-shard48of59.bin", "group1-shard49of59.bin", "group1-shard50of59.bin", "group1-shard51of59.bin", "group1-shard52of59.bin", "group1-shard53of59.bin", "group1-shard54of59.bin", "group1-shard55of59.bin", "group1-shard56of59.bin", "group1-shard57of59.bin", "group1-shard58of59.bin", "group1-shard59of59.bin"], "weights": [{"name": "transunet_down0_0/kernel", "shape": [3, 3, 3, 3, 16], "dtype": "float32"}, {"name": "transunet_down0_0_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_0_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_0_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_0_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_1/kernel", "shape": [3, 3, 3, 16, 16], "dtype": "float32"}, {"name": "transunet_down0_1_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_1_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_1_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "transunet_down0_1_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "transunet_down1_conv_0/kernel", "shape": [3, 3, 3, 16, 32], "dtype": "float32"}, {"name": "transunet_down1_conv_0_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_0_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_0_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_0_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_1/kernel", "shape": [3, 3, 3, 32, 32], "dtype": "float32"}, {"name": "transunet_down1_conv_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "transunet_down1_conv_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "transunet_down2_conv_0/kernel", "shape": [3, 3, 3, 32, 64], "dtype": "float32"}, {"name": "transunet_down2_conv_0_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_0_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_0_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_0_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_1/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "transunet_down2_conv_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "transunet_down2_conv_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "transunet_conv_trans_before/kernel", "shape": [1, 1, 1, 64, 64], "dtype": "float32"}, {"name": "patch_embedding/dense/kernel", "shape": [4096, 512], "dtype": "float32"}, {"name": "patch_embedding/dense/bias", "shape": [512], "dtype": "float32"}, {"name": "patch_embedding/embedding/embeddings", "shape": [16, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_layer_norm_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_0_layer_norm_1/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/query/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/query/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/key/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/key/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/value/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/value/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/attention_output/kernel", "shape": [8, 512, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_atten/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_0_layer_norm_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_0_layer_norm_2/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_0_mlp_dense_0/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transunet_ViT_0_mlp_dense_0/bias", "shape": [2048], "dtype": "float32"}, {"name": "transunet_ViT_0_mlp_dense_1/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transunet_ViT_0_mlp_dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_1_layer_norm_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_1_layer_norm_1/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/query/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/query/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/key/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/key/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/value/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/value/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/attention_output/kernel", "shape": [8, 512, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_atten/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_1_layer_norm_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_1_layer_norm_2/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_1_mlp_dense_0/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transunet_ViT_1_mlp_dense_0/bias", "shape": [2048], "dtype": "float32"}, {"name": "transunet_ViT_1_mlp_dense_1/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transunet_ViT_1_mlp_dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_2_layer_norm_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_2_layer_norm_1/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/query/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/query/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/key/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/key/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/value/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/value/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/attention_output/kernel", "shape": [8, 512, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_atten/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_2_layer_norm_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_2_layer_norm_2/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_2_mlp_dense_0/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transunet_ViT_2_mlp_dense_0/bias", "shape": [2048], "dtype": "float32"}, {"name": "transunet_ViT_2_mlp_dense_1/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transunet_ViT_2_mlp_dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_3_layer_norm_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_3_layer_norm_1/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/query/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/query/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/key/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/key/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/value/kernel", "shape": [512, 8, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/value/bias", "shape": [8, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/attention_output/kernel", "shape": [8, 512, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_atten/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_3_layer_norm_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_3_layer_norm_2/beta", "shape": [512], "dtype": "float32"}, {"name": "transunet_ViT_3_mlp_dense_0/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transunet_ViT_3_mlp_dense_0/bias", "shape": [2048], "dtype": "float32"}, {"name": "transunet_ViT_3_mlp_dense_1/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transunet_ViT_3_mlp_dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 32768], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [32768], "dtype": "float32"}, {"name": "transunet_conv_trans_after/kernel", "shape": [1, 1, 1, 512, 64], "dtype": "float32"}, {"name": "transunet_up0_conv_before_concat_0/kernel", "shape": [3, 3, 3, 64, 32], "dtype": "float32"}, {"name": "transunet_up0_conv_before_concat_0_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_before_concat_0_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_before_concat_0_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_before_concat_0_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_0/kernel", "shape": [3, 3, 3, 64, 32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_0_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_0_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_0_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_0_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_1/kernel", "shape": [3, 3, 3, 32, 32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "transunet_up0_conv_after_concat_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "transunet_up1_conv_before_concat_0/kernel", "shape": [3, 3, 3, 32, 16], "dtype": "float32"}, {"name": "transunet_up1_conv_before_concat_0_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_before_concat_0_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_before_concat_0_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_before_concat_0_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_0/kernel", "shape": [3, 3, 3, 32, 16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_0_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_0_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_0_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_0_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_1/kernel", "shape": [3, 3, 3, 16, 16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_1_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_1_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_1_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "transunet_up1_conv_after_concat_1_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "transunet_output/kernel", "shape": [1, 1, 1, 16, 1], "dtype": "float32"}, {"name": "transunet_output/bias", "shape": [1], "dtype": "float32"}]}]}